cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

brew "act"
brew "awscli"
brew "ghq"
brew "git"
brew "go"
brew "kotlin"
brew "peco"
brew "protobuf"
brew "rbenv"
brew "readline"
brew "ruby-build"
brew "rust"
brew "terraform"
brew "tree"
brew "vim"
brew "volta"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Applications

cask "1password"
cask "1password-cli"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "dash"
cask "deepl"
cask "docker"
cask "figma"
cask "flutter"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "hammerspoon"
cask "insomnia"
cask "iterm2-beta"
cask "karabiner-elements"
cask "kindle"
cask "notion"
cask "obsidian"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"

# Fonts

cask "font-jetbrains-mono"
