cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

brew "ghq"
brew "git"
brew "go"
brew "kotlin"
brew "peco"
brew "readline"
brew "ripgrep"
brew "rbenv"
brew "ruby-build"
brew "terraform"
brew "tree"
brew "vim"
brew "zsh"

# Applications

cask "1password"
cask "1password-cli"
cask "android-studio"
cask "appcleaner"
cask "alfred"
cask "dash"
cask "docker"
cask "dropbox"
cask "figma"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "hammerspoon"
cask "insomnia"
cask "iterm2-beta"
cask "jasper"
cask "java"
cask "karabiner-elements"
cask "kindle"
cask "notion"
cask "sequel-pro"
cask "slack-beta"
cask "station"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoomus"

# Fonts

cask "font-source-han-code-jp"
