cask_args appdir: "/Applications"
tap "hashicorp/tap"

brew "act"
brew "awscli"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "hashicorp/tap/terraform"
brew "kotlin"
brew "peco"
brew "rbenv"
brew "readline"
brew "mise"
brew "ripgrep"
brew "ruby-build"
brew "rust"
brew "sqlite"
brew "starship"
brew "tree"
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Applications
cask "claude-code"
cask "codex"
cask "appcleaner"
cask "docker-desktop"
cask "figma"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-japanese-ime"
cask "hammerspoon"
cask "insomnia"
cask "iterm2-beta"
cask "karabiner-elements"
cask "notion"
cask "slack"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono"
